from .summarizer_logic import textrank,get_sentence_vector

test_article = """सताब्दियौंदेखि संसारभर कागजी नोट तथा सिक्का (भौतिक मुद्रा) प्रचलनमा छन् । पछिल्लो समय अभौतिक मुद्राको विकासमा विश्वका धेरै मुलुकहरुले काम गरिरहेका छन् ।

एक अध्ययनले देखाए अनुसार विश्व अर्थतन्त्रमा ९८ प्रतिशत योगदान रहेका देशका केन्द्रीय बैंकले ‘सेन्ट्रल बैंक डिजिटल करेन्सी’ (सीबीडीसी) विकास गर्न काम गरिरहेका छन् ।

सीबीडीसी भनेको भौतिक मुद्रालाई अभौतिक (डिजिटल) रुपमा प्रचलनमा ल्याउने प्रणाली हो । यसको निष्कासन नै अभौतिक रुपमा हुन्छ । भौतिक मुद्रा जस्तै सीबीडीसी पनि विभिन्न किसिमका हुन्छन् । यसको नियन्त्रण केन्द्रीय बैंकबाट नै हुन्छ । यसको कानुनी अधिकार केन्द्रीय बैंकसँग हुन्छ । यसको दायित्व पनि केन्द्रीय बैंकको नै हुन्छ ।

अहिले केन्द्रीय बैंकले नोट निष्कासन गर्छ । साथै इ–मनिको रुपमा मोबाइल बैंकिङ, मोबाइल वालेट लगायतको डिजिटल भुक्तानी उपकरण मार्फत कारोबार हुँदै आएको छ । यसको ‘ब्याकअप’ मा बैकहरुसँग नोट नै रहन्छ ।

सेन्ट्रल बैंक डिजिटल करेन्सीको पनि ‘केन्द्रीय बैंक’ नै त्यसको ज्ञारेन्टीको रुपमा रहन्छ । खुद्रा सीबीडीसी भएमा त्यसको ‘ब्याकअप’मा बैंक वा केन्द्रीय बैंक हुन्छ । अहिले मोबाइल बैंकिङ, इन्टरनेट बैंकिङ, क्युआर कोडको कारोबार तत्काल भएपनि त्यसको सेटलमेन्ट भने १/२ दिनमा मात्रै हुन्छ ।

सीबीडीसी रियल टाइममा सेटलमन्ट हुन्छ । डिजिटल रुपमा मुद्रा निष्कासन गर्ने र त्यसको दायित्व लिनेगरी ‘ब्लकचेन प्रविधि’ मा आधारित रहेर केन्द्रिकृत रुपमा मुद्राको कारोबार गर्न अनुमति प्रदान गरिन्छ भने त्यसलाई सीबीडीसी भनिन्छ ।

विश्वव्यापी रुपमा सीबीडीसीको सुरुवात र तीव्र विकास कोभिड सँगसँगै भएको देखिन्छ । त्यसअघि नै ब्लकचेन प्रविधिमा आधारित भएर क्रिप्टोरकरेन्सी तीव्र विकास भइसकेको थियो । त्यसले परम्परागत कागजी मुद्रामाथि चुनौती थपेकै थियो ।"""

# Get extractive summary using TextRank 
extractive_summary = textrank(test_article.split('।'), embeddings)
print("Extractive Summary:", '।'.join(extractive_summary))